In [27]:
import pandas as pd
import numpy as np

누락된 데이터의 존재를 파악하는 법

(1) 누락된 값을 전체적으로 가리키는 마스크를 사용(주로 Numpy)
    - boolean을 할당함 => 계산의 오버헤드 일으킬 수도 있음
    
(2) 누락된 항목 하나를 가리키는 센티널 값을 선택 하는 방법(None, NaN 등)(주로 Pandas)
    - 모든 데이터 타입에적용 될 수 없음

None: 파이선의 누락된 데이터

In [28]:
vals = np.array([1, None, 3, 4]) # object인 배열 즉 파이선에서만 사용 가능 하고 None이 있으면 연산은 안됨
vals

array([1, None, 3, 4], dtype=object)

NaN(not a number): 표준 IEEE 부동 소숫점 표기를 사용하는 모든 시스템에서 사용됨(**floating type)
                   모든 NaN이 포함된 연산은 NaN으로 귀결 된다

In [29]:
vals2 = np.array([1, np.nan, 3,4]) # upcating을 상기하자
vals2

array([  1.,  nan,   3.,   4.])

In [30]:
vals2.dtype

dtype('float64')

In [31]:
1 + np.nan

nan

In [32]:
0 * np.nan

nan

In [33]:
vals2.sum(), vals2.min(), vals2.max() # 파이선과는 달리 오류는 나지 않고 NaN이 결과값으로 출력

(nan, nan, nan)

In [34]:
#Numpy 에서 NaN을 제외하고 계산하는 방법이 있다.
np.nansum(vals2), np.nanmin(vals2), np.nanmax(vals2)

(8.0, 1.0, 4.0)

Pandas에서는 None을 NaN으로 변환한다

In [35]:
pd.Series([1, np.nan, 2, None])

0    1.0
1    NaN
2    2.0
3    NaN
dtype: float64

In [36]:
x = pd.Series(range(2), dtype=int)
x

0    0
1    1
dtype: int32

In [37]:
x[0] = None
x

0    NaN
1    1.0
dtype: float64

널 값 연산하기

isnull() ==> 누락 값을 가리키는 Boolean(True) 마스크를 자동으로 생성 ==> Null 값을 찾아냄

notnull() ==> isnull의 역 ==> Null 값이 아닌 것을 찾아냄

dropna() ==> 데이터에 필터를 적용한 버전을 반환함

fillna() ==> 누락값을 채우거나 전가된 데이터 사본을 반환함

In [38]:
# Null 값 탐지
data = pd.Series([1, np.nan, 'hello', None])
data.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [39]:
# Series와 DataFrame에 Boolean을 인덱스로 사용하기
data[data.notnull()]

0        1
2    hello
dtype: object

In [40]:
data[data.isnull()]

1     NaN
3    None
dtype: object

In [41]:
# Null 값 제거하기
data.dropna()

0        1
2    hello
dtype: object

In [43]:
# DataFrame은 많은 다양한 방식이 존재 함
df = pd.DataFrame([[1,      np.nan, 2],
                  [2,      3,      5],
                  [np.nan, 4,      6]])
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [44]:
# DataFrame 에서는 전체 행과 열 삭제(단일 값만 삭제하는 것은 안됨)
df.dropna()

     0    1  2
1  2.0  3.0  5

In [45]:
df.dropna(axis=1)

   2
0  2
1  5
2  6

In [47]:
df.dropna(axis='columns')

   2
0  2
1  5
2  6

Signature: df.dropna(axis=0, how='any', thresh=None, subset=None, inplace=False)
Docstring:
Return object with labels on given axis omitted where alternately any
or all of the data are missing

Parameters
----------
axis : {0 or 'index', 1 or 'columns'}, or tuple/list thereof
    Pass tuple or list to drop on multiple axes
how : {'any', 'all'}
    * any : if any NA values are present, drop that label
    * all : if all values are NA, drop that label
thresh : int, default None
    int value : require that many non-NA values
subset : array-like
    Labels along other axis to consider, e.g. if you are dropping rows
    these would be a list of columns to include
inplace : boolean, default False
    If True, do operation inplace and return None.

Returns
-------
dropped : DataFrame

Examples
--------
>>> df = pd.DataFrame([[np.nan, 2, np.nan, 0], [3, 4, np.nan, 1],
...                    [np.nan, np.nan, np.nan, 5]],
...                   columns=list('ABCD'))
>>> df
     A    B   C  D
0  NaN  2.0 NaN  0
1  3.0  4.0 NaN  1
2  NaN  NaN NaN  5

Drop the columns where all elements are nan:

>>> df.dropna(axis=1, how='all')
     A    B  D
0  NaN  2.0  0
1  3.0  4.0  1
2  NaN  NaN  5

Drop the columns where any of the elements is nan

>>> df.dropna(axis=1, how='any')
   D
0  0
1  1
2  5

Drop the rows where all of the elements are nan
(there is no row to drop, so df stays the same):

>>> df.dropna(axis=0, how='all')
     A    B   C  D
0  NaN  2.0 NaN  0
1  3.0  4.0 NaN  1
2  NaN  NaN NaN  5

Keep only the rows with at least 2 non-na values:

>>> df.dropna(thresh=2)
     A    B   C  D
0  NaN  2.0 NaN  0
1  3.0  4.0 NaN  1
File:      c:\users\jsong\anaconda3\lib\site-packages\pandas\core\frame.py
Type:      method

In [49]:
df[3] = np.nan # Series 를 추가함??
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [55]:
# 기본 매개변수 how='any' 대신 how='all' == 모두가 널값인 행이나 열만 삭제할 수 있도록 함

df.dropna(axis='columns', how='all')

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [56]:
df.dropna(axis=1, how='all')

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [57]:
df.dropna(axis=0, how='all')

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [58]:
# thresh 매개변수로 행이나 열에서 널이 아닌 값이 최소 몇개는 있어야 하는지 지정
# thresh=3 널이 아닌 값이 적어도 3개는 있어야 선택

df.dropna(thresh=3)

     0    1  2   3
1  2.0  3.0  5 NaN

In [59]:
df.dropna(axis='rows', thresh=3)

     0    1  2   3
1  2.0  3.0  5 NaN

In [60]:
df.dropna(axis=1, thresh=2)

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [61]:
df.dropna(axis=1, thresh=3)

   2
0  2
1  5
2  6

널값 채우기: fillna() 메서드

In [64]:
data = pd.Series([1, np.nan, 2, None, 3], index=list('abcde'))
data

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [65]:
# 0과 같은 단일 값으로 NaN 채우기
data.fillna(0)

a    1.0
b    0.0
c    2.0
d    0.0
e    3.0
dtype: float64

In [66]:
#이전 값으로 채우기
data.fillna(method='ffill')

a    1.0
b    1.0
c    2.0
d    2.0
e    3.0
dtype: float64

In [69]:
# 바로 다은 오는 값으로 채우기
data.fillna(method='bfill')

a    1.0
b    2.0
c    2.0
d    3.0
e    3.0
dtype: float64

In [70]:
# DataFrame 도 유사하지만 어느 축을 따라 채울지 axis로 정의
# axis = 0 이면 행을 따라, axis = 1 이면 열을 따라

df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [71]:
df.fillna(method='ffill', axis=1)

     0    1    2    3
0  1.0  1.0  2.0  2.0
1  2.0  3.0  5.0  5.0
2  NaN  4.0  6.0  6.0

In [72]:
df.fillna(method='ffill', axis=0)

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  2.0  4.0  6 NaN